import os
from collections import Counter

# 分类原始数据集结构 标签名@中文名，如下
# img_folder
# 	--Q30@葬甲科
# 	--QT1@蜻蜓目
# 	--Z1@蝼蛄科
# 	--L105
# 	--B1@大红蝽

# 现在给定img_folder路径，python实现将其转成训练集的格式即修改文件名使其是保留标签名，
# 且根据子文件夹名中的标签名与中文名制作一个python字典打印出来，注意子文件夹名可能只有一个标签名，而没有@中文名，
# 这时候字典中的中文名就跟标签名保持相同即可，

dict = {'Q30': '葬甲科', 'L79': '杨二尾舟蛾', 'L373': '落叶松毛虫', 'L16': '灰歹夜蛾', 'Q57': '眼斑沟芫菁', 'Q26': '叶甲科', 'B32': '飞虱科', 'L90': '草地螟', 'B42': '锥头叶蝉属', 'B13': '电光叶蝉', 'L161': '梨小食心虫', 'L165': '灰土苔蛾', 'L206': '海绿尺蛾', 'Q51': '八星粉天牛', 'Z7': '三眼新草螽', 'S7': '粗鬃驼舞虻', 'B4': '褐飞虱属', 'Q46': '萤科', 'L214': '草螟科', 'L194': '毒蛾科', 'B29': '六刺素猎蝽', 'Q13': '侧条逮步甲', 'L339': '干纹夜蛾', 'Q4': '龙虱科', 'L1': '二化螟', 'L202': '黑点蚀叶野螟', 'L374': '黑斑始夜蛾', 'Q42': '绿缘扁角叶甲', 'L170': '掌夜蛾', 'Q58': '华武粪金龟', 'L58': '委夜蛾', 'Q56': '垫甲属', 'B25': '樟颈曼盲蝽', 'L112': '线委夜蛾', 'L353': '夜蛾科', 'olegs': 'olegs', 'B23': '叶蝉科', 'L15': '朽木夜蛾', 'Q62': '扁莱步甲', 'B19': '稻黑蝽', 'L59': '棉铃夜蛾（棉铃虫）', 'B39': '长蝽科', 'L151': '美苔蛾属', 'Q47': '凹跗青步甲', 'L371': '朝尺蛾', 'L73': '缘点（土）苔蛾', 'L11': '劳氏粘虫', 'L13': '杉温冬夜蛾', 'MO7': '东方蜜蜂', 'Q1': '梭毒隐翅虫(青翅蚁形隐翅甲)', 'G1': '慈螋', 'Z4': '螽斯科', 'L336': '点夜蛾属', 'L211': '巢蛾科', 'L31': '丁香天蛾', 'L351': '栗六点天蛾', 'L28': '雀纹天蛾', 'Z3': '蟋蟀科', 'Q60': '大绿异丽金龟', 'B54': '稻绿蝽属', 'L103': '亚麻篱灯蛾', 'L9': '大螟', 'B1': '大红蝽', 'L29': '甘薯天蛾', 'L217': '白斑陌夜蛾', 'S2': '无霸大蚊', 'Q70': '黑尾六角步甲', 'L188': '卷蛾科', 'Q10': '青步甲', 'M1': '草蛉科', 'B6': '灰飞虱', 'L120': '灯蛾科', 'B43': '大青叶蝉', 'Q63': '木色玛绢金龟', 'B38': '白脊飞虱', 'L17': '小地老虎', 'L23': '丝棉木金星尺蛾', 'L64': '三角璃尺蛾', 'L169': '红缘灯蛾', 'L330': '裂缘野螟', 'S8': '蚊科', 'L4': '黄杨绢须野螟', 'L332': '升麻裳夜蛾', 'Z5': '直翅目', 'B9': '稻绿蝽', 'B41': '烟翅白背飞虱', 'L14': '间纹德夜蛾（间敏炫夜蛾）', 'L197': '小筒水螟', 'L34': '人纹污灯蛾', 'L6': '白蜡绢须野螟', 'ZZ1': '园蛛属', 'MO6': '黄脚胡蜂', 'B33': '黑扁叶蝉属', 'B27': '山竹缘蝽', 'M4': '日本通草蛉', 'L213': '舞毒蛾', 'B28': '中华鼻蜡蝉', 'L98': '棉大卷叶螟', 'L338': '华小卷蛾属', 'L67': '大星天蛾', 'L166': '顶斑内弧尺蛾', 'L87': '二点委夜蛾', 'Q7': '铜绿丽金龟', 'L130': '杨雪毒蛾', 'S1': '蝉科', 'Q52': '镜面虎甲', 'B44': '姬缘蝽科', 'L38': '大丽灯蛾', 'B5': '白背飞虱', 'Q55': '马铃薯瓢虫', 'Q69': '双斑青步甲', 'B7': '双斑痕叶蝉', 'L42': '瓜绢（野）螟', 'MAO1': '毛翅目', 'B16': '白背飞虱属', 'Q50': '云纹虎甲', 'L352': '尺蛾科', 'L2': '稻纵卷叶螟', 'L186': '黄后夜蛾', 'L189': '艳刺蛾', 'L215': '齿螟蛾', 'B8': '茶翅蝽', 'L104': '小菜蛾', 'L39': '重阳木锦斑蛾', 'S5': '眼蕈蚊科', 'L203': '川灰长翅卷蛾', 'L126': '杨小舟蛾', 'L218': '流夜蛾属', 'L82': '稻巢草螟', 'Q48': '中华婪步甲', 'L182': '粉蝶灯蛾', 'Q29': '高山天牛', 'L35': '八点灰灯蛾', 'L372': '波斜带尺蛾', 'B31': '派罗飞虱属', 'L152': '土苔蛾属', 'Q39': '黄缘龙虱', 'L184': '印度谷螟', 'B12': '黑尾叶蝉', 'B36': '深色长头飞虱', 'L350': '黑长喙天蛾', 'L27': '构月天蛾', 'L18': '白斑烦夜蛾', 'B24': '松村大马蝉', 'L156': '钻夜蛾属', 'L22': '绿尾大蚕蛾', 'Q64': '筛胸梳爪叩甲', 'L201': '毛穿孔尺蛾', 'L159': '东方黏虫', 'L204': '吉安氏簑水螟', 'L346': '疆夜蛾', 'Q41': '隆线梭腹牙甲', 'Q37': '蓝弗叶甲', 'Q12': '金龟科', 'Q40': '梳爪叩甲属', 'MO5': '黑泥蜂', 'MO3': '泥蜂科', 'L200': '豆髯须夜蛾', 'L41': '桃蛀螟', 'QT1': '蜻蜓目', 'FY1': '蜉蝣目', 'L190': '黑点贪夜蛾', 'L227': '广鹿蛾', 'S4': '大蚊科', 'L199': '衣蛾', 'L342': '灰巢螟', 'L21': '苎麻夜蛾', 'L164': '豆天蛾', 'B22': '黄翅大白蚁', 'Q43': '象甲科', 'L24': '雪尾尺蛾', 'L229': '豆（荚）野螟', 'Q65': '莱氏猛叩甲', 'L191': '鳞翅目', 'L193': '螟蛾科', 'L3': '黄纹银草螟', 'L216': '粘夜蛾属', 'L129': '旱柳原野螟', 'L63': '猫眼尺蛾', 'M3': '钩努褐蛉', 'L96': '瘦银锭夜蛾', 'B40': '牧草盲蝽', 'Z1': '蝼蛄科', 'L33': '葡萄缺角天蛾', 'B14': '绿盲蝽', 'L37': '优美(葩)苔蛾', 'Q33': '奇裂跗步甲', 'L349': '灰斑豆天蛾', 'Q44': '鞘翅目', 'L123': '扁刺蛾', 'Q49': '隆线异土甲', 'L74': '（中华）曲苔蛾', 'L340': '标俚夜蛾', 'FL2': '中华地鳖', 'MO8': '茶毛虫细颚姬蜂', 'L185': '天蛾科', 'L341': '灰直纹螟', 'L47': '斜纹夜蛾', 'L40': '（亚洲）玉米螟', 'L127': '黄翅缀叶野螟', 'L86': '草地贪夜蛾', 'Q11': '大黑鳃金龟', 'L208': '基褐绿刺蛾', 'L26': '红天蛾', 'L75': '戟盗毒蛾', 'L224': '线天蛾属', 'S9': '沼泽大蚊', 'L343': '稻暗水螟', 'L335': '白背斑蠹蛾', 'L212': '卫矛巢蛾', 'Q59': '白星花金龟', 'M2': '丽草蛉', 'Q31': '锐宽突龙虱', 'Q36': '药材甲', 'L337': '苹果蠹蛾', 'B37': '玉米花翅飞虱', 'N1': '广狭啮', 'S6': '蝇科', 'L145': '中带网蛾', 'L370': '小蜡绢须野螟', 'L160': '警纹地老虎', 'L345': '薄纱毒蛾', 'L81': '三化螟', 'MO4': '细足捷蚁', 'FL1': '澳洲大蠊', 'Q25': '鳃金龟亚科', 'Q45': '网目拟地甲', 'Q28': '柯氏素菌瓢虫', 'L36': '之美苔蛾', 'L209': '（巨）艳青尺蛾', 'B15': '珀蝽', 'L94': '黑条灰灯蛾', 'L60': '烟草夜蛾（烟青虫）', 'L115': '乏夜蛾', 'Q35': '奥氏弩萤', 'L344': '黄星雪灯蛾', 'MO2': '胡蜂科', 'L183': '蓑蛾科', 'L205': '舟蛾科', 'B26': '蝽科', 'L187': '褐萍塘水螟', 'L72': '黄土苔蛾（巨土苔蛾）', 'Q54': '瓢虫科', 'S3': '镇江细腹食虫虻', 'L20': '鸟嘴壶夜蛾', 'B10': '大鳖土蝽', 'L84': '八字地老虎', 'L10': '银纹夜蛾', 'L210': '苜蓿巢螟', 'L25': '斑雅尺蛾', 'B34': '蓼飞虱', 'L46': '稻螟蛉', 'L93': '甜菜夜蛾', 'Q34': '麦穗斑步甲', 'L157': '桑绢（丝）野螟', 'B35': '白条飞虱', 'L347': '三线姬尺蛾', 'G2': '蠼螋科', 'L85': '黄地老虎', 'Z6': '短额负蝗', 'MAO2': '银纹长角石蛾', 'B18': '小绿叶蝉', 'L30': '红六点天蛾', 'Q67': '步甲科', 'Q38': '四斑尖角伪瓢虫', 'L192': '漆尾夜蛾', 'Q53': '朽木甲科', 'B3': '黄足猎蝽', 'B30': '长绿飞虱', 'L43': '甜菜白带野螟', 'L53': '粉纹钻夜蛾'}

def rename_folders_and_create_dict(img_folder):
    # 创建一个用于存储标签名和中文名的字典
    label_dict = {}
    label_array = []
    # 遍历图像文件夹中的子文件夹,建立标签字典
    for folder_name in os.listdir(img_folder):
        folder_path = os.path.join(img_folder, folder_name)
        
        # 判断是否是文件夹
        if os.path.isdir(folder_path):
            # 检查是否包含 '@' 分隔符
            if '@' in folder_name:
                # 按照 '@' 分隔标签名和中文名
                label, chinese_name = folder_name.split('@', 1)
            else:
                # 没有 '@' 的情况，标签名与中文名相同
                label = folder_name
                chinese_name = folder_name
            label_array.append(label)
            # 更新字典
            label_dict[label] = chinese_name
            
            # 重命名文件夹，只保留标签名
            new_folder_path = os.path.join(img_folder, label)
            os.rename(folder_path, new_folder_path)
    duplicates = {label: count for label, count in Counter(label_array).items() if count > 1}  # 查找重复的标签名，重要！！！！！！！！！！！！！！！！！！！！！
    print(duplicates)
    # 打印字典
    print(label_dict)
    return label_dict

# 示例用法
img_folder = '/home/yaoteam/yaoteam/yyc/random_paste_work/小图训练集所有图片/何工纠正一二类害虫数据集/train0806'  # 替换为实际路径
rename_folders_and_create_dict(img_folder)

