# 新任务：现在有一个分类数据集，子目录都为类别名，现在要根据已有的tag_map映射字典，将中文名映射为代号，python实现
import os
import shutil
old_folder_name = ['二化螟','稻纵卷叶螟','黄纹银野螟','黄杨绢野螟','褚翅叉环野螟','白蜡绢须野螟','橄绿歧角螟','黑纹歧角螟','大螟','银纹夜蛾','劳氏粘虫','陌夜蛾','温杉冬夜蛾','间纹德夜蛾','朽木夜蛾','灰歹夜蛾',
            '小地老虎','白点烦夜蛾','茶色狭翅夜蛾','鸟嘴壶夜蛾','苎麻夜蛾','绿尾大蚕蛾','丝棉木金星尺蛾','雪尾尺蛾','斑雅尺蛾','红天蛾','构月天蛾','雀纹天蛾','甘薯天蛾','红六点天蛾','丁香天蛾','霜天蛾',
            '葡萄缺角天蛾','人纹污灯蛾','八点灰灯蛾','之美苔蛾','优美苔蛾','大丽灯蛾','重阳木锦斑蛾','玉米螟','桃蛀螟','瓜绢野螟','甜菜白带野螟','豆荚螟','黄金镰翅野螟','稻螟蛉',
            '斜纹夜蛾','南方锞夜蛾','粉纹夜蛾','白条夜蛾','粘虫','钻夜蛾','粉纹钻夜蛾','玫瑰巾夜蛾','臭椿皮蛾','畸夜蛾','流夜蛾','委夜蛾','棉铃虫','烟青虫','银杏珠天蚕蛾','棕线燕蛾','猫眼尺蛾','三角璃尺蛾',
            '小豆长喙天蛾','九节木长喙天蛾','大星天蛾','枣桃六点天蛾','枣核鹰翅天蛾','土色苔蛾','代步土苔蛾','黄土苔蛾','缘点苔蛾','曲苔蛾','戟盗毒蛾','黄毒蛾','榆掌舟蛾','核桃美舟蛾','杨二雪舟蛾','咖啡木蠹蛾',
            '三化螟','稻巢草螟','台湾稻螟','八字地老虎','黄地老虎','草地贪夜蛾','二点委夜蛾','地老虎','豆野螟','草地螟','豆荚斑螟','尖锥额野螟','甜菜夜蛾','黑条灰灯蛾','豆毒蛾','瘦银锭夜蛾','甘蓝夜蛾','棉大卷叶螟',
            '大造桥虫','谐夜蛾','甘薯麦蛾','旋歧夜蛾','亚麻篱灯蛾','小菜蛾','宽胫夜蛾','涓夜蛾','麦牧野螟','早熟禾拟茎草螟','干纹冬夜蛾','歧角螟','石蛾','线委夜蛾','白肾俚夜蛾','标瑙夜蛾','乏夜蛾','紫条尺蛾','水螟',
            '虚俚夜蛾','白点暗野螟','灯蛾科','绿刺蛾','褛裳夜蛾','扁刺蛾','榆黄足毒蛾','杨扇舟蛾','杨小舟蛾','黄翅缀叶野螟','细条纹野螟','旱柳原野螟','杨雪毒蛾','盗毒蛾','榆绿天蛾','春尺蠖','楸蠹野螟','桑螟','美国白蛾',
            '红云翅斑螟','榆白边舟蛾','竹大黄野螟','金黄镰翅野螟','竹螟','松毛虫属','卷叶蛾科','青尺蛾','黄毒蛾属','鹿蛾','白毒蛾属','槐尺蛾','四斑绢野螟','中带三角夜蛾','美苔蛾属','苔蛾科','黑纹黄灯蛾','草雪苔蛾','姬尺蛾',
            '钻夜蛾属','桑绢野螟','瓜绢螟','东方粘虫','警纹地老虎','梨小食心虫','黄字地老虎','青翅蚁形隐翅甲','瓢甲类','荧叶甲','龙虱','黑绒鳃金龟','暗黑鳃金龟','铜绿丽金龟','二叉犀金龟','天牛类','青步甲','大黑鳃金龟','金龟科',
            '扁刺蛾','隐翅虫','褐角庶尺蛾','埋葬甲','灰胸突鳃金龟','叩甲','蝼蛄','蝗虫','蟋蟀','大红蝽','黑环土蝽','黄足猎蝽','褐飞虱','白背飞虱','灰飞虱','双斑痕叶蝉','茶翅蝽','稻绿蝽','大鳖土蝽','稻棘缘蝽','黑尾叶蝉','电光叶蝉',
            '绿盲蝽','珀蝽','柳蓝叶甲','突背斑红蝽','小绿叶蝉','稻黑蝽','草蛉类','y1','y2','SBPH','镜面虎甲','尾夜蛾','舞毒蛾','朽木甲']
new_folder_name = ['L1','L2','L3','L4','L5','L6','L7','L8','L9','L10','L11','L12','L13','L14','L15','L16','L17','L18','L19','L20','L21','L22','L23','L24','L25','L26','L27','L28','L29','L30','L31','L32',
            'L33','L34','L35','L36','L37','L38','L39','L40','L41','L42','L43','L44','L45','L46','L47','L48','L49','L50','L51','L52','L53','L54','L55','L56','L57','L58','L59','L60','L61','L62','L63',
            'L64','L65','L66','L67','L68','L69','L70','L71','L72','L73','L74','L75','L76','L77','L78','L79','L80','L81','L82','L83','L84','L85','L86','L87','L88','L89','L90','L91','L92','L93','L94',
            'L95','L96','L97','L98','L99','L100','L101','L102','L103','L104','L105','L106','L107','L108','L109','L110','L111','L112','L113','L114','L115','L116','L117','L118','L119','L120','L121',
            'L122','L123','L124','L125','L126','L127','L128','L129','L130','L131','L132','L133','L134','L135','L136','L137','L138','L139','L140','L141','L142','L143','L144','L145','L146','L147',
            'L148','L149','L150','L151','L152','L153','L154','L155','L156','L157','L158','L159','L160','L161','L162','Q1','Q2','Q3','Q4','Q5','Q6','Q7','Q8','Q9','Q10','Q11','Q12','Q13','Q14','Q15',
            'Q16','Q17','Q18','Z1','Z2','Z3','B1','B2','B3','B4','B5','B6','B7','B8','B9','B10','B11','B12','B13','B14','B15','B16','B17','B18','B19','M1','B5','B4','B6','AMO5','AL48','Ayyc1', 'Ayyc2']

folder_mapping = dict(zip(old_folder_name, new_folder_name))
# 定义数据集路径和映射字典
dataset_path = '/home/yaoteam/yaoteam/yyc/mmdet_dino/新整理的测报灯网站以及水稻所拍摄混合虫样图0724/冯泽霖拍摄的50多种虫样(未处理)'

# 遍历数据集目录并重命名子目录

for dir_name in os.listdir(dataset_path):
    dir_path = os.path.join(dataset_path, dir_name)
    if os.path.isdir(dir_path) and dir_name in folder_mapping:
        new_dir_name = folder_mapping[dir_name]
        new_dir_path = os.path.join(dataset_path, new_dir_name)
        shutil.move(dir_path, new_dir_path)
        print(f'Renamed "{dir_name}" to "{new_dir_name}"')



print("Renaming completed.")
